9/data/attachments/ad6075eb82da4e45.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_81c8aa6b-f2e9-4484-97ad-af51b585e73e</nif:username>
            <nif:friendToBeAdded>Sarah_yeah_Friend_31544_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>